RT-Thread/rt-thread/bsp/stm32f4xx-HAL/drivers/drv_gpio.c
    __STM32_PIN(3, E, 4),
    __STM32_PIN(4, E, 5),
    __STM32_PIN(5, E, 6),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(7, I, 8),
    __STM32_PIN(8, C, 13),
    __STM32_PIN(9, C, 14),
    __STM32_PIN(10, C, 15),
    __STM32_PIN(11, I, 9),
    __STM32_PIN(12, I, 10),
    __STM32_PIN(13, I, 11),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(16, F, 0),
    __STM32_PIN(17, F, 1),
    __STM32_PIN(18, F, 2),
    __STM32_PIN(19, F, 3),
    __STM32_PIN(20, F, 4),
    __STM32_PIN(21, F, 5),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(24, F, 6),
    __STM32_PIN(25, F, 7),
    __STM32_PIN(26, F, 8),
    __STM32_PIN(27, F, 9),
    __STM32_PIN(28, F, 10),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(32, C, 0),
    __STM32_PIN(33, C, 1),
    __STM32_PIN(34, C, 2),
    __STM32_PIN(35, C, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(40, A, 0),
    __STM32_PIN(41, A, 1),
    __STM32_PIN(42, A, 2),
    __STM32_PIN(43, H, 2),
    __STM32_PIN(44, H, 3),
    __STM32_PIN(45, H, 4),
    __STM32_PIN(46, H, 5),
    __STM32_PIN(47, A, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(50, A, 4),
    __STM32_PIN(51, A, 5),
    __STM32_PIN(52, A, 6),
    __STM32_PIN(53, A, 7),
    __STM32_PIN(54, C, 4),
    __STM32_PIN(55, C, 5),
    __STM32_PIN(56, B, 0),
    __STM32_PIN(57, B, 1),
    __STM32_PIN(58, B, 2),
    __STM32_PIN(59, F, 11),
    __STM32_PIN(60, F, 12),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(63, F, 13),
    __STM32_PIN(64, F, 14),
    __STM32_PIN(65, F, 15),
    __STM32_PIN(66, G, 0),
    __STM32_PIN(67, G, 1),
    __STM32_PIN(68, E, 7),
    __STM32_PIN(69, E, 8),
    __STM32_PIN(70, E, 9),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(73, E, 10),
    __STM32_PIN(74, E, 11),
    __STM32_PIN(75, E, 12),
    __STM32_PIN(76, E, 13),
    __STM32_PIN(77, E, 14),
    __STM32_PIN(78, E, 15),
    __STM32_PIN(79, B, 10),
    __STM32_PIN(80, B, 11),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(83, H, 6),
    __STM32_PIN(84, H, 7),
    __STM32_PIN(85, H, 8),
    __STM32_PIN(86, H, 9),
    __STM32_PIN(87, H, 10),
    __STM32_PIN(88, H, 11),
    __STM32_PIN(89, H, 12),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(92, B, 12),
    __STM32_PIN(93, B, 13),
    __STM32_PIN(94, B, 14),
    __STM32_PIN(95, B, 15),
    __STM32_PIN(96, D, 8),
    __STM32_PIN(97, D, 9),
    __STM32_PIN(98, D, 10),
    __STM32_PIN(99, D, 11),
    __STM32_PIN(100, D, 12),
    __STM32_PIN(101, D, 13),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(104, D, 14),
    __STM32_PIN(105, D, 15),
    __STM32_PIN(106, G, 2),
    __STM32_PIN(107, G, 3),
    __STM32_PIN(108, G, 4),
    __STM32_PIN(109, G, 5),
    __STM32_PIN(110, G, 6),
    __STM32_PIN(111, G, 7),
    __STM32_PIN(112, G, 8),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(115, C, 6),
    __STM32_PIN(116, C, 7),
    __STM32_PIN(117, C, 8),
    __STM32_PIN(118, C, 9),
    __STM32_PIN(119, A, 8),
    __STM32_PIN(120, A, 9),
    __STM32_PIN(121, A, 10),
    __STM32_PIN(122, A, 11),
    __STM32_PIN(123, A, 12),
    __STM32_PIN(124, A, 13),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(128, H, 13),
    __STM32_PIN(129, H, 14),
    __STM32_PIN(130, H, 15),
    __STM32_PIN(131, I, 0),
    __STM32_PIN(132, I, 1),
    __STM32_PIN(133, I, 2),
    __STM32_PIN(134, I, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(137, A, 14),
    __STM32_PIN(138, A, 15),
    __STM32_PIN(139, C, 10),
    __STM32_PIN(140, C, 11),
    __STM32_PIN(141, C, 12),
    __STM32_PIN(142, D, 0),
    __STM32_PIN(143, D, 1),
    __STM32_PIN(144, D, 2),
    __STM32_PIN(145, D, 3),
    __STM32_PIN(146, D, 4),
    __STM32_PIN(147, D, 5),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(150, D, 6),
    __STM32_PIN(151, D, 7),
    __STM32_PIN(152, G, 9),
    __STM32_PIN(153, G, 10),
    __STM32_PIN(154, G, 11),
    __STM32_PIN(155, G, 12),
    __STM32_PIN(156, G, 13),
    __STM32_PIN(157, G, 14),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(160, G, 15),
    __STM32_PIN(161, B, 3),
    __STM32_PIN(162, B, 4),
    __STM32_PIN(163, B, 5),
    __STM32_PIN(164, B, 6),
    __STM32_PIN(165, B, 7),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(167, B, 8),
    __STM32_PIN(168, B, 9),
    __STM32_PIN(169, E, 0),
    __STM32_PIN(170, E, 1),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(173, I, 4),
    __STM32_PIN(174, I, 5),
    __STM32_PIN(175, I, 6),
    __STM32_PIN(176, I, 7),
#endif
#if (STM32F4xx_PIN_NUMBERS == 208)
    __STM32_PIN_DEFAULT,
    __STM32_PIN(1, E, 2),
    __STM32_PIN(2, E, 3),
    __STM32_PIN(3, E, 4),
    __STM32_PIN(4, E, 5),
    __STM32_PIN(5, E, 6),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(7, I, 8),
    __STM32_PIN(8, C, 13),
    __STM32_PIN(9, C, 14),
    __STM32_PIN(10, C, 15),
    __STM32_PIN(11, I, 9),
    __STM32_PIN(12, I, 10),
    __STM32_PIN(13, I, 11),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(16, F, 0),
    __STM32_PIN(17, F, 1),
    __STM32_PIN(18, F, 2),
    __STM32_PIN(19, I, 12),
    __STM32_PIN(20, I, 13),
    __STM32_PIN(21, I, 14),
    __STM32_PIN(22, F, 3),
    __STM32_PIN(23, F, 4),
    __STM32_PIN(24, F, 5),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(27, F, 6),
    __STM32_PIN(28, F, 7),
    __STM32_PIN(29, F, 8),
    __STM32_PIN(30, F, 9),
    __STM32_PIN(31, F, 10),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(35, C, 0),
    __STM32_PIN(36, C, 1),
    __STM32_PIN(37, C, 2),
    __STM32_PIN(38, C, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(43, A, 0),
    __STM32_PIN(44, A, 1),
    __STM32_PIN(45, A, 2),
    __STM32_PIN(46, H, 2),
    __STM32_PIN(47, H, 3),
    __STM32_PIN(48, H, 4),
    __STM32_PIN(49, H, 5),
    __STM32_PIN(50, A, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(53, A, 4),
    __STM32_PIN(54, A, 5),
    __STM32_PIN(55, A, 6),
    __STM32_PIN(56, A, 7),
    __STM32_PIN(57, C, 4),
    __STM32_PIN(58, C, 5),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(61, B, 0),
    __STM32_PIN(62, B, 1),
    __STM32_PIN(63, B, 2),
    __STM32_PIN(64, I, 15),
    __STM32_PIN(65, J, 0),
    __STM32_PIN(66, J, 1),
    __STM32_PIN(67, J, 2),
    __STM32_PIN(68, J, 3),
    __STM32_PIN(69, J, 4),
    __STM32_PIN(70, F, 11),
    __STM32_PIN(71, F, 12),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(74, F, 13),
    __STM32_PIN(75, F, 14),
    __STM32_PIN(76, F, 15),
    __STM32_PIN(77, G, 0),
    __STM32_PIN(78, G, 1),
    __STM32_PIN(79, E, 7),
    __STM32_PIN(80, E, 8),
    __STM32_PIN(81, E, 9),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(84, E, 10),
    __STM32_PIN(85, E, 11),
    __STM32_PIN(86, E, 12),
    __STM32_PIN(87, E, 13),
    __STM32_PIN(88, E, 14),
    __STM32_PIN(89, E, 15),
    __STM32_PIN(90, B, 10),
    __STM32_PIN(91, B, 11),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(95, J, 5),
    __STM32_PIN(96, H, 6),
    __STM32_PIN(97, H, 7),
    __STM32_PIN(98, H, 8),
    __STM32_PIN(99, H, 9),
    __STM32_PIN(100, H, 10),
    __STM32_PIN(101, H, 11),
    __STM32_PIN(102, H, 12),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(104, B, 12),
    __STM32_PIN(105, B, 13),
    __STM32_PIN(106, B, 14),
    __STM32_PIN(107, B, 15),
    __STM32_PIN(108, D, 8),
    __STM32_PIN(109, D, 9),
    __STM32_PIN(110, D, 10),
    __STM32_PIN(111, D, 11),
    __STM32_PIN(112, D, 12),
    __STM32_PIN(113, D, 13),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(104, D, 14),
    __STM32_PIN(105, D, 15),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(129, G, 2),
    __STM32_PIN(130, G, 3),
    __STM32_PIN(131, G, 4),
    __STM32_PIN(132, G, 5),
    __STM32_PIN(133, G, 6),
    __STM32_PIN(134, G, 7),
    __STM32_PIN(135, G, 8),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(138, C, 6),
    __STM32_PIN(139, C, 7),
    __STM32_PIN(140, C, 8),
    __STM32_PIN(141, C, 9),
    __STM32_PIN(142, A, 8),
    __STM32_PIN(143, A, 9),
    __STM32_PIN(144, A, 10),
    __STM32_PIN(145, A, 11),
    __STM32_PIN(146, A, 12),
    __STM32_PIN(147, A, 13),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(151, H, 13),
    __STM32_PIN(152, H, 14),
    __STM32_PIN(153, H, 15),
    __STM32_PIN(154, I, 0),
    __STM32_PIN(155, I, 1),
    __STM32_PIN(156, I, 2),
    __STM32_PIN(157, I, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(159, A, 14),
    __STM32_PIN(160, A, 15),
    __STM32_PIN(161, C, 10),
    __STM32_PIN(162, C, 11),
    __STM32_PIN(163, C, 12),
    __STM32_PIN(164, D, 0),
    __STM32_PIN(165, D, 1),
    __STM32_PIN(166, D, 2),
    __STM32_PIN(167, D, 3),
    __STM32_PIN(168, D, 4),
    __STM32_PIN(169, D, 5),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(172, D, 6),
    __STM32_PIN(173, D, 7),
    __STM32_PIN(174, J, 12),
    __STM32_PIN(175, J, 13),
    __STM32_PIN(176, J, 14),
    __STM32_PIN(177, J, 15),
    __STM32_PIN(178, G, 9),
    __STM32_PIN(179, G, 10),
    __STM32_PIN(180, G, 11),
    __STM32_PIN(181, G, 12),
    __STM32_PIN(182, G, 13),
    __STM32_PIN(183, G, 14),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(186, K, 3),
    __STM32_PIN(187, K, 4),
    __STM32_PIN(188, K, 5),
    __STM32_PIN(189, K, 6),
    __STM32_PIN(190, K, 7),
    __STM32_PIN(191, G, 15),
    __STM32_PIN(192, B, 3),
    __STM32_PIN(193, B, 4),
    __STM32_PIN(194, B, 5),
    __STM32_PIN(195, B, 6),
    __STM32_PIN(196, B, 7),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(198, B, 8),
    __STM32_PIN(199, B, 9),
    __STM32_PIN(200, E, 0),
    __STM32_PIN(201, E, 1),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(205, I, 4),
    __STM32_PIN(206, I, 5),
    __STM32_PIN(207, I, 6),
    __STM32_PIN(208, I, 7),
#endif
#if (STM32F4xx_PIN_NUMBERS == 216)
    __STM32_PIN_DEFAULT,
    __STM32_PIN(1, E, 2),
    __STM32_PIN(2, E, 3),
    __STM32_PIN(3, E, 4),
    __STM32_PIN(4, E, 5),
    __STM32_PIN(5, E, 6),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(9, I, 8),
    __STM32_PIN(10, C, 13),
    __STM32_PIN(11, C, 14),
    __STM32_PIN(12, C, 15),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(14, I, 9),
    __STM32_PIN(15, I, 10),
    __STM32_PIN(16, I, 11),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(19, F, 0),
    __STM32_PIN(20, F, 1),
    __STM32_PIN(21, F, 2),
    __STM32_PIN(22, I, 12),
    __STM32_PIN(23, I, 13),
    __STM32_PIN(24, I, 14),
    __STM32_PIN(25, F, 3),
    __STM32_PIN(26, F, 4),
    __STM32_PIN(27, F, 5),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(30, F, 6),
    __STM32_PIN(31, F, 7),
    __STM32_PIN(32, F, 8),
    __STM32_PIN(33, F, 9),
    __STM32_PIN(34, F, 10),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(38, C, 0),
    __STM32_PIN(39, C, 1),
    __STM32_PIN(40, C, 2),
    __STM32_PIN(41, C, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(48, A, 0),
    __STM32_PIN(49, A, 1),
    __STM32_PIN(50, A, 2),
    __STM32_PIN(51, H, 2),
    __STM32_PIN(52, H, 3),
    __STM32_PIN(53, H, 4),
    __STM32_PIN(54, H, 5),
    __STM32_PIN(55, A, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(59, A, 4),
    __STM32_PIN(60, A, 5),
    __STM32_PIN(61, A, 6),
    __STM32_PIN(62, A, 7),
    __STM32_PIN(63, C, 4),
    __STM32_PIN(64, C, 5),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(67, B, 0),
    __STM32_PIN(68, B, 1),
    __STM32_PIN(69, B, 2),
    __STM32_PIN(70, I, 15),
    __STM32_PIN(71, J, 0),
    __STM32_PIN(72, J, 1),
    __STM32_PIN(73, J, 2),
    __STM32_PIN(74, J, 3),
    __STM32_PIN(75, J, 4),
    __STM32_PIN(76, F, 11),
    __STM32_PIN(77, F, 12),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(80, F, 13),
    __STM32_PIN(81, F, 14),
    __STM32_PIN(82, F, 15),
    __STM32_PIN(83, G, 0),
    __STM32_PIN(84, G, 1),
    __STM32_PIN(85, E, 7),
    __STM32_PIN(86, E, 8),
    __STM32_PIN(87, E, 9),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(90, E, 10),
    __STM32_PIN(91, E, 11),
    __STM32_PIN(92, E, 12),
    __STM32_PIN(93, E, 13),
    __STM32_PIN(94, E, 14),
    __STM32_PIN(95, E, 15),
    __STM32_PIN(96, B, 10),
    __STM32_PIN(97, B, 11),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(101, J, 5),
    __STM32_PIN(102, H, 6),
    __STM32_PIN(103, H, 7),
    __STM32_PIN(104, H, 8),
    __STM32_PIN(105, H, 9),
    __STM32_PIN(106, H, 10),
    __STM32_PIN(107, H, 11),
    __STM32_PIN(108, H, 12),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(111, B, 12),
    __STM32_PIN(112, B, 13),
    __STM32_PIN(113, B, 14),
    __STM32_PIN(114, B, 15),
    __STM32_PIN(115, D, 8),
    __STM32_PIN(116, D, 9),
    __STM32_PIN(117, D, 10),
    __STM32_PIN(118, D, 11),
    __STM32_PIN(119, D, 12),
    __STM32_PIN(120, D, 13),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(123, D, 14),
    __STM32_PIN(124, D, 15),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(136, G, 2),
    __STM32_PIN(137, G, 3),
    __STM32_PIN(138, G, 4),
    __STM32_PIN(139, G, 5),
    __STM32_PIN(140, G, 6),
    __STM32_PIN(141, G, 7),
    __STM32_PIN(142, G, 8),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(145, C, 6),
    __STM32_PIN(146, C, 7),
    __STM32_PIN(147, C, 8),
    __STM32_PIN(148, C, 9),
    __STM32_PIN(149, A, 8),
    __STM32_PIN(150, A, 9),
    __STM32_PIN(151, A, 10),
    __STM32_PIN(152, A, 11),
    __STM32_PIN(153, A, 12),
    __STM32_PIN(154, A, 13),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(158, H, 13),
    __STM32_PIN(159, H, 14),
    __STM32_PIN(160, H, 15),
    __STM32_PIN(161, I, 0),
    __STM32_PIN(162, I, 1),
    __STM32_PIN(163, I, 2),
    __STM32_PIN(164, I, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(167, A, 14),
    __STM32_PIN(168, A, 15),
    __STM32_PIN(169, C, 10),
    __STM32_PIN(170, C, 11),
    __STM32_PIN(171, C, 12),
    __STM32_PIN(172, D, 0),
    __STM32_PIN(173, D, 1),
    __STM32_PIN(174, D, 2),
    __STM32_PIN(175, D, 3),
    __STM32_PIN(176, D, 4),
    __STM32_PIN(177, D, 5),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(180, D, 6),
    __STM32_PIN(181, D, 7),
    __STM32_PIN(182, J, 12),
    __STM32_PIN(183, J, 13),
    __STM32_PIN(184, J, 14),
    __STM32_PIN(185, J, 15),
    __STM32_PIN(186, G, 9),
    __STM32_PIN(187, G, 10),
    __STM32_PIN(188, G, 11),
    __STM32_PIN(189, G, 12),
    __STM32_PIN(190, G, 13),
    __STM32_PIN(191, G, 14),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(194, K, 3),
    __STM32_PIN(195, K, 4),
    __STM32_PIN(196, K, 5),
    __STM32_PIN(197, K, 6),
    __STM32_PIN(198, K, 7),
    __STM32_PIN(199, G, 15),
    __STM32_PIN(200, B, 3),
    __STM32_PIN(201, B, 4),
    __STM32_PIN(202, B, 5),
    __STM32_PIN(203, B, 6),
    __STM32_PIN(204, B, 7),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(206, B, 8),
    __STM32_PIN(207, B, 9),
    __STM32_PIN(208, E, 0),
    __STM32_PIN(209, E, 1),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(213, I, 4),
    __STM32_PIN(214, I, 5),
    __STM32_PIN(215, I, 6),
    __STM32_PIN(216, I, 7),
#endif
};

struct pin_irq_map
{
    rt_uint16_t pinbit;
    IRQn_Type irqno;
};

